Revit 2027 API
FileDialog.IsValidFilterString Method
 Determines if the input string is acceptable as input for a FileDialog filter string.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidFilterString(
	string filterString
)
Public Shared Function IsValidFilterString (
	filterString As String
) As Boolean
public:
static bool IsValidFilterString(
	String^ filterString
)
static member IsValidFilterString :
        filterString : string -> bool
Parameters
filterString String
 The filter string.
Return Value
Boolean
 True of the filter string meets the minimal requirements to be a valid filter string.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FileDialog Class
Autodesk.Revit.UI Namespace